name: "SqueezeNet_v1.1_grayscale_128px_BN"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  data_param {
    source: "/home/gpu-admin/data/ImageNet_preprocessed/ilsvrc12_train_lmdb"
    batch_size: 512
    backend: LMDB
  }
  transform_param {
    crop_size: 128
    mean_value: 117
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  data_param {
    source: "/home/gpu-admin/data/ImageNet_preprocessed/ilsvrc12_val_lmdb"
    batch_size: 512
    backend: LMDB
  }
  transform_param {
    crop_size: 128
    mean_value: 117
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    kernel: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1_bn"
}
layer {
  name: "conv1_bn_scale"
  type: "Scale"
  bottom: "conv1_bn"
  top: "conv1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu_conv1"
  type: "ReLU"
  bottom: "conv1_bn"
  top: "conv1_bn"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_bn"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire2/squeeze1x1"
  type: "Convolution"
  bottom: "pool1"
  top: "fire2/squeeze1x1"
  convolution_param {
    num_output: 16
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire2/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire2/squeeze1x1"
  top: "fire2/squeeze1x1_bn"
}
layer {
  name: "fire2/squeeze1x1_bn_scale"
  type: "Scale"
  bottom: "fire2/squeeze1x1_bn"
  top: "fire2/squeeze1x1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire2/relu_squeeze1x1"
  type: "ReLU"
  bottom: "fire2/squeeze1x1_bn"
  top: "fire2/squeeze1x1_bn"
}
layer {
  name: "fire2/expand1x1"
  type: "Convolution"
  bottom: "fire2/squeeze1x1"
  top: "fire2/expand1x1"
  convolution_param {
    num_output: 64
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire2/expand3x3"
  type: "Convolution"
  bottom: "fire2/squeeze1x1"
  top: "fire2/expand3x3"
  convolution_param {
    num_output: 64
    kernel: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire2/concat"
  type: "Concat"
  bottom: "fire2/expand1x1"
  bottom: "fire2/expand3x3"
  top: "fire2/concat"
}
layer {
  name: "fire2/concat_bn"
  type: "BatchNorm"
  bottom: "fire2/concat"
  top: "fire2/concat_bn"
}
layer {
  name: "fire2/concat_bn_scale"
  type: "Scale"
  bottom: "fire2/concat_bn"
  top: "fire2/concat_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire2/relu_concat"
  type: "ReLU"
  bottom: "fire2/concat_bn"
  top: "fire2/concat_bn"
}
layer {
  name: "fire3/squeeze1x1"
  type: "Convolution"
  bottom: "fire2/concat_bn"
  top: "fire3/squeeze1x1"
  convolution_param {
    num_output: 16
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire3/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire3/squeeze1x1"
  top: "fire3/squeeze1x1_bn"
}
layer {
  name: "fire3/squeeze1x1_bn_scale"
  type: "Scale"
  bottom: "fire3/squeeze1x1_bn"
  top: "fire3/squeeze1x1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire3/relu_squeeze1x1"
  type: "ReLU"
  bottom: "fire3/squeeze1x1_bn"
  top: "fire3/squeeze1x1_bn"
}
layer {
  name: "fire3/expand1x1"
  type: "Convolution"
  bottom: "fire3/squeeze1x1"
  top: "fire3/expand1x1"
  convolution_param {
    num_output: 64
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire3/expand3x3"
  type: "Convolution"
  bottom: "fire3/squeeze1x1"
  top: "fire3/expand3x3"
  convolution_param {
    num_output: 64
    kernel: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire3/concat"
  type: "Concat"
  bottom: "fire3/expand1x1"
  bottom: "fire3/expand3x3"
  top: "fire3/concat"
}
layer {
  name: "fire3/concat_bn"
  type: "BatchNorm"
  bottom: "fire3/concat"
  top: "fire3/concat_bn"
}
layer {
  name: "fire3/concat_bn_scale"
  type: "Scale"
  bottom: "fire3/concat_bn"
  top: "fire3/concat_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire3/relu_concat"
  type: "ReLU"
  bottom: "fire3/concat_bn"
  top: "fire3/concat_bn"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "fire3/concat_bn"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire4/squeeze1x1"
  type: "Convolution"
  bottom: "pool3"
  top: "fire4/squeeze1x1"
  convolution_param {
    num_output: 24
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire4/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire4/squeeze1x1"
  top: "fire4/squeeze1x1_bn"
}
layer {
  name: "fire4/squeeze1x1_bn_scale"
  type: "Scale"
  bottom: "fire4/squeeze1x1_bn"
  top: "fire4/squeeze1x1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire4/relu_squeeze1x1"
  type: "ReLU"
  bottom: "fire4/squeeze1x1_bn"
  top: "fire4/squeeze1x1_bn"
}
layer {
  name: "fire4/expand1x1"
  type: "Convolution"
  bottom: "fire4/squeeze1x1"
  top: "fire4/expand1x1"
  convolution_param {
    num_output: 96
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire4/expand3x3"
  type: "Convolution"
  bottom: "fire4/squeeze1x1"
  top: "fire4/expand3x3"
  convolution_param {
    num_output: 96
    kernel: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire4/concat"
  type: "Concat"
  bottom: "fire4/expand1x1"
  bottom: "fire4/expand3x3"
  top: "fire4/concat"
}
layer {
  name: "fire4/concat_bn"
  type: "BatchNorm"
  bottom: "fire4/concat"
  top: "fire4/concat_bn"
}
layer {
  name: "fire4/concat_bn_scale"
  type: "Scale"
  bottom: "fire4/concat_bn"
  top: "fire4/concat_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire4/relu_concat"
  type: "ReLU"
  bottom: "fire4/concat_bn"
  top: "fire4/concat_bn"
}
layer {
  name: "fire5/squeeze1x1"
  type: "Convolution"
  bottom: "fire4/concat_bn"
  top: "fire5/squeeze1x1"
  convolution_param {
    num_output: 24
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire5/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire5/squeeze1x1"
  top: "fire5/squeeze1x1_bn"
}
layer {
  name: "fire5/squeeze1x1_bn_scale"
  type: "Scale"
  bottom: "fire5/squeeze1x1_bn"
  top: "fire5/squeeze1x1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire5/relu_squeeze1x1"
  type: "ReLU"
  bottom: "fire5/squeeze1x1_bn"
  top: "fire5/squeeze1x1_bn"
}
layer {
  name: "fire5/expand1x1"
  type: "Convolution"
  bottom: "fire5/squeeze1x1"
  top: "fire5/expand1x1"
  convolution_param {
    num_output: 96
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire5/expand3x3"
  type: "Convolution"
  bottom: "fire5/squeeze1x1"
  top: "fire5/expand3x3"
  convolution_param {
    num_output: 96
    kernel: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire5/concat"
  type: "Concat"
  bottom: "fire5/expand1x1"
  bottom: "fire5/expand3x3"
  top: "fire5/concat"
}
layer {
  name: "fire5/concat_bn"
  type: "BatchNorm"
  bottom: "fire5/concat"
  top: "fire5/concat_bn"
}
layer {
  name: "fire5/concat_bn_scale"
  type: "Scale"
  bottom: "fire5/concat_bn"
  top: "fire5/concat_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire5/relu_concat"
  type: "ReLU"
  bottom: "fire5/concat_bn"
  top: "fire5/concat_bn"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "fire5/concat_bn"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire6/squeeze1x1"
  type: "Convolution"
  bottom: "pool5"
  top: "fire6/squeeze1x1"
  convolution_param {
    num_output: 32
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire6/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire6/squeeze1x1"
  top: "fire6/squeeze1x1_bn"
}
layer {
  name: "fire6/squeeze1x1_bn_scale"
  type: "Scale"
  bottom: "fire6/squeeze1x1_bn"
  top: "fire6/squeeze1x1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire6/relu_squeeze1x1"
  type: "ReLU"
  bottom: "fire6/squeeze1x1_bn"
  top: "fire6/squeeze1x1_bn"
}
layer {
  name: "fire6/expand1x1"
  type: "Convolution"
  bottom: "fire6/squeeze1x1"
  top: "fire6/expand1x1"
  convolution_param {
    num_output: 128
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire6/expand3x3"
  type: "Convolution"
  bottom: "fire6/squeeze1x1"
  top: "fire6/expand3x3"
  convolution_param {
    num_output: 128
    kernel: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire6/concat"
  type: "Concat"
  bottom: "fire6/expand1x1"
  bottom: "fire6/expand3x3"
  top: "fire6/concat"
}
layer {
  name: "fire6/concat_bn"
  type: "BatchNorm"
  bottom: "fire6/concat"
  top: "fire6/concat_bn"
}
layer {
  name: "fire6/concat_bn_scale"
  type: "Scale"
  bottom: "fire6/concat_bn"
  top: "fire6/concat_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire6/relu_concat"
  type: "ReLU"
  bottom: "fire6/concat_bn"
  top: "fire6/concat_bn"
}
layer {
  name: "fire7/squeeze1x1"
  type: "Convolution"
  bottom: "fire6/concat_bn"
  top: "fire7/squeeze1x1"
  convolution_param {
    num_output: 32
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire7/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire7/squeeze1x1"
  top: "fire7/squeeze1x1_bn"
}
layer {
  name: "fire7/squeeze1x1_bn_scale"
  type: "Scale"
  bottom: "fire7/squeeze1x1_bn"
  top: "fire7/squeeze1x1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire7/relu_squeeze1x1"
  type: "ReLU"
  bottom: "fire7/squeeze1x1_bn"
  top: "fire7/squeeze1x1_bn"
}
layer {
  name: "fire7/expand1x1"
  type: "Convolution"
  bottom: "fire7/squeeze1x1"
  top: "fire7/expand1x1"
  convolution_param {
    num_output: 128
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire7/expand3x3"
  type: "Convolution"
  bottom: "fire7/squeeze1x1"
  top: "fire7/expand3x3"
  convolution_param {
    num_output: 128
    kernel: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire7/concat"
  type: "Concat"
  bottom: "fire7/expand1x1"
  bottom: "fire7/expand3x3"
  top: "fire7/concat"
}
layer {
  name: "fire7/concat_bn"
  type: "BatchNorm"
  bottom: "fire7/concat"
  top: "fire7/concat_bn"
}
layer {
  name: "fire7/concat_bn_scale"
  type: "Scale"
  bottom: "fire7/concat_bn"
  top: "fire7/concat_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire7/relu_concat"
  type: "ReLU"
  bottom: "fire7/concat_bn"
  top: "fire7/concat_bn"
}
layer {
  name: "fire8/squeeze1x1"
  type: "Convolution"
  bottom: "fire7/concat_bn"
  top: "fire8/squeeze1x1"
  convolution_param {
    num_output: 64
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire8/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire8/squeeze1x1"
  top: "fire8/squeeze1x1_bn"
}
layer {
  name: "fire8/squeeze1x1_bn_scale"
  type: "Scale"
  bottom: "fire8/squeeze1x1_bn"
  top: "fire8/squeeze1x1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire8/relu_squeeze1x1"
  type: "ReLU"
  bottom: "fire8/squeeze1x1_bn"
  top: "fire8/squeeze1x1_bn"
}
layer {
  name: "fire8/expand1x1"
  type: "Convolution"
  bottom: "fire8/squeeze1x1"
  top: "fire8/expand1x1"
  convolution_param {
    num_output: 256
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire8/expand3x3"
  type: "Convolution"
  bottom: "fire8/squeeze1x1"
  top: "fire8/expand3x3"
  convolution_param {
    num_output: 256
    kernel: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire8/concat"
  type: "Concat"
  bottom: "fire8/expand1x1"
  bottom: "fire8/expand3x3"
  top: "fire8/concat"
}
layer {
  name: "fire8/concat_bn"
  type: "BatchNorm"
  bottom: "fire8/concat"
  top: "fire8/concat_bn"
}
layer {
  name: "fire8/concat_bn_scale"
  type: "Scale"
  bottom: "fire8/concat_bn"
  top: "fire8/concat_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire8/relu_concat"
  type: "ReLU"
  bottom: "fire8/concat_bn"
  top: "fire8/concat_bn"
}
layer {
  name: "fire9/squeeze1x1"
  type: "Convolution"
  bottom: "fire8/concat_bn"
  top: "fire9/squeeze1x1"
  convolution_param {
    num_output: 64
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire9/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire9/squeeze1x1"
  top: "fire9/squeeze1x1_bn"
}
layer {
  name: "fire9/squeeze1x1_bn_scale"
  type: "Scale"
  bottom: "fire9/squeeze1x1_bn"
  top: "fire9/squeeze1x1_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire9/relu_squeeze1x1"
  type: "ReLU"
  bottom: "fire9/squeeze1x1_bn"
  top: "fire9/squeeze1x1_bn"
}
layer {
  name: "fire9/expand1x1"
  type: "Convolution"
  bottom: "fire9/squeeze1x1"
  top: "fire9/expand1x1"
  convolution_param {
    num_output: 256
    kernel: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire9/expand3x3"
  type: "Convolution"
  bottom: "fire9/squeeze1x1"
  top: "fire9/expand3x3"
  convolution_param {
    num_output: 256
    kernel: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    bias_term: false
  }
}
layer {
  name: "fire9/concat"
  type: "Concat"
  bottom: "fire9/expand1x1"
  bottom: "fire9/expand3x3"
  top: "fire9/concat"
}
layer {
  name: "fire9/concat_bn"
  type: "BatchNorm"
  bottom: "fire9/concat"
  top: "fire9/concat_bn"
}
layer {
  name: "fire9/concat_bn_scale"
  type: "Scale"
  bottom: "fire9/concat_bn"
  top: "fire9/concat_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fire9/relu_concat"
  type: "ReLU"
  bottom: "fire9/concat_bn"
  top: "fire9/concat_bn"
}
layer {
  name: "drop9"
  type: "Dropout"
  bottom: "fire9/concat_bn"
  top: "fire9/concat_bn"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "conv10"
  type: "Convolution"
  bottom: "fire9/concat"
  top: "conv10"
  convolution_param {
    num_output: 1000
    kernel: 1
    weight_filler {
      type: "gaussian"
      mean: 0
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv10_bn"
  type: "BatchNorm"
  bottom: "conv10"
  top: "conv10_bn"
}
layer {
  name: "conv10_bn_scale"
  type: "Scale"
  bottom: "conv10_bn"
  top: "conv10_bn"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu_conv10"
  type: "ReLU"
  bottom: "conv10_bn"
  top: "conv10_bn"
}
layer {
  name: "pool10"
  type: "Pooling"
  bottom: "conv10"
  top: "pool10"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "pool10"
  bottom: "label"
  top: "loss"
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "pool10"
  bottom: "label"
  top: "accuracy"
}
layer {
  name: "accuracy_top5"
  type: "Accuracy"
  bottom: "pool10"
  bottom: "label"
  top: "accuracy_top5"
  accuracy_param {
    top_k: 5
  }
}
